Repository: sasagh/NpDir
Catalog: src/NpDirectory.Api/Resources/Resources.*.resx
Languages: ka_ge

# Validation.Name.Required
source: Name is required
ka_ge: სახელი სავალდებულოა

# Validation.Name.TooShort
source: Name must be at least 2 characters long
ka_ge: სახელი უნდა შეიცავდეს მინიმუმ 2 სიმბოლოს

# Validation.Name.TooLong
source: Name cannot exceed 50 characters
ka_ge: სახელი არ უნდა აღემატებოდეს 50 სიმბოლოს

# Validation.Name.Invalid
source: Name must contain only Georgian or English letters
ka_ge: სახელი უნდა შეიცავდეს მხოლოდ ქართულ ან ინგლისურ ასოებს

# Validation.Sex.Invalid
source: Invalid sex value
ka_ge: არასწორი სქესის მნიშვნელობა

# Validation.PersonalNumber.Required
source: Personal number is required
ka_ge: პირადი ნომერი სავალდებულოა

# Validation.PersonalNumber.Invalid
source: Personal number must be 11 digits
ka_ge: პირადი ნომერი უნდა შედგებოდეს 11 ციფრისგან

# Validation.City.NotFound
source: City not found
ka_ge: ქალაქი ვერ მოიძებნა

# Validation.BirthDate.Required
source: Birth date is required
ka_ge: დაბადების თარიღი სავალდებულოა

# Validation.BirthDate.Future
source: Birth date cannot be in the future
ka_ge: დაბადების თარიღი არ შეიძლება იყოს მომავალში

# Validation.Image.Invalid
source: Invalid image format. Allowed formats are
ka_ge: სურათის არასწორი ფორმატი. დასაშვები ფორმატებია

# Validation.PhoneNumber.Required
source: At least one phone number is required
ka_ge: მინიმუმ ერთი ტელეფონის ნომერი სავალდებულოა

# Validation.PhoneNumber.Type.Invalid
source: Invalid phone number type
ka_ge: ტელეფონის ნომრის არასწორი ტიპი

# Validation.PhoneNumber.TooShort
source: Phone number must be at least 2 characters long
ka_ge: ტელეფონის ნომერი უნდა შეიცავდეს მინიმუმ 2 სიმბოლოს

# Validation.PhoneNumber.TooLong
source: Phone number cannot exceed 50 characters
ka_ge: ტელეფონის ნომერი არ უნდა აღემატებოდეს 50 სიმბოლოს

# Error.NaturalPerson.NotFound
source: Natural person not found
ka_ge: ფიზიკური პირი ვერ მოიძებნა

# Error.PersonalNumber.AlreadyExists
source: Personal number already exists
ka_ge: ტელეფონის ნომერი უკვე არსებობს

# Error.Image.Required
source: Image is required
ka_ge: ფოტო სავალდებულოა

# Error.Relation.AlreadyExists
source: Relation already exists
ka_ge: კავშირი უკვე არსებობს

# Error.Id.Empty
source: Id is required
ka_ge: აიდის ველი სავალდებულოა

# Error.Id.GreaterThanZero
source: Id should be greater than 0
ka_ge: აიდი მეტი მეტი უნდა იყოს 0-ზე

# Error.Relation.SamePerson
source: Same person
ka_ge: იგივე პირი

# Error.NaturalPerson.AlreadyExists
source: Person already exists
ka_ge: ფიზიკური პირი უკვე არსებობს

# Error.Relation.NotFound
source: Relation not found
ka_ge: კავშირი არ არსებობს

# Error.PhoneNumber.AlreadyExists
source: Phone number already exists
ka_ge: ნომერი უკვე არსებობს

# Validation.BirthDate.TooYoung
source: Person should be at least 18 years old
ka_ge: ფიზიკური პირი უნდა იყოს მინიმუმ 18 წლის
